CREATE TABLE [Типи пива]
( 
id int identity(1,1) not null primary key,
Назва CHAR(50) not null,
Характеристика text not null
)

CREATE TABLE Пиво
(
id int identity(1,1)  not null primary key,
[Вміст алкоголю] float not null,
IPA int not null,
[Тип пива] char(50) not null foreign key(id)references[Типи пива](id)
)

CREATE TABLE Пивовар
(
id int identity(1,1)  not null primary key,
Псевдонім char(20) not null,
[Дата народження] date not null,
[Роки досвіду] tinyint not null,
Пиво char(50) not null foreign key(id)references[Пиво](id)
)

CREATE TABLE [Покупці пива]
(
id int identity(1,1)  not null primary key,
[Назва компанії] text not null,
Місто char(20) not null,
[Контактні дані] text not null,
)

CREATE TABLE [Список замовлень]
(
id int identity(1,1)  not null primary key,
Пиво char(50) not null foreign key(id)references[Пиво](id),
Покупець char(20) null foreign key(id)references[Покупці пива](id),
Ціна float not null,
Кількість int not null,
)

CREATE TABLE [Відгуки про пиво]
(
id int identity(1,1)  not null primary key,
Пиво char(50) not null foreign key(id)references[Пиво](id),
Відгук text null,
Покупець char(20) null foreign key(id)references[Покупці пива](id),
)

ALTER TABLE[Список замовлень]
add Валюта char(20) not null;

insert into [dbo].[Типи пива](Назва,Характеристика)
values('Altbier','Альбби представляє собою традиційний німецький ель, медованого кольору та прозорого, ясного смаку з кремовою пивною шапкою. Найвідоміші альтбрири варять у Дюссельдорфі з нездовжніх часів. Як відомо, елі були найпоширенішим видом пива до винаходу в Баварії в XVI столітті лагеров.В цьому контексті приставка Alt означає древній.По легенда, ель варили давні германські та кельтські племена ще 3000 років тому .Вміст алкоголю в сучасному алтбіре складає від 4,7 до 4,9%. Також эль після процесу варки з використанням елеів дрожжя, витримує один - два місяці в бочках, перед безпосереднім споживанням. Крім того, для варки Дюссельдорфера використовується ячмінь. Відомі зразки альтбір є Франкенхайм і Дейбельс.',
'Bockbier ','Щільне пиво з високим вмістом алкоголю (деякі зразки містять до 19%). Зимовий сорт німецького пива, який починають варити не пізніше середини жовтня. На відміну від середньовіччя, коли Бокбіри були Ельовіт типу, сучасні варяться способом. Початок пивоваріння Бокбіра доводиться на 1 жовтня, коли стартує новий фінансовий рік для німецьких пивоварів. Цікаво, що в Баварії з XVI по XIX століття було заборонено пивоваріння в літній період, через неможливість контролювати процеси попадання в пиво різних бактерій, поширених в теплу пору року. Тому історично пивоваріння відбувалося навесні і восени. Залежно від конкретного сезону бік вариться для різноманітних німецьких урочистостей, починаючи від Різдва (Weihnachtsbier), Doppelbock (міцніша версія звичайного боки) і травневого Maibock.',
'Dinkelbier','оригинальный представитель пшеничного пивного семейства. Dinkel – это разновидность пшеницы, культивируемая с раннего средневековья на некоторых территориях германского государства. Всего несколько баварских пивоварен варят пиво с использованием пшеницы динкел. Основной причиной этому служит повышенное содержание протеина в этом виде зерновых благодаря, которой он больше подходит для выпечки хлеба, чем для пива. После завершения процесса брожения Динкелбиру необходимо несколько месяцев вызревания при температуре близкой к точке замерзания. Из-за повышенного содержания протеинов, пенная шапка при наливании в бокал гораздо больше, чем у обычного пива. Содержание алкоголя в Динкелбире порядка 4,5%. Известным пивоваром, который варит  Dinkelbier  является Lammsbräu.'
)

insert into [dbo].Пиво (IPA,[Вміст алкоголю],[Тип пива])
values(
'12','8','Altbiter',
'16','12','Bockbier',
'11','6','Dinkelbier'
)

insert into Пивовар([Дата народження],Пиво,Псевдонім,[Роки досвіду])
values(
'1982-12-14','Altbiter','jon','7',
'1986-6-12','Bockbier','Big BoB','6',
'1972-4-24','Dinkelbier','Poroshenko','16'
)
insert into [Покупці пива]([Контактні дані],Місто,[Назва компанії])
values(
'0632678934','Lviv','ФФУ',
'0658766889','Vynnucia','Укр.Пошта'
)

insert into [Список замовлень](Кількість,Пиво,Покупець,Ціна)
values(
'240','Bockbier','ФФУ','50',
'1000','Dinkelbier','Укр.Пошта','62'
)

insert into [Відгуки про пиво](Відгук,Пиво,Покупець)
values(
'Супер','Dinkelbier','Укр.Пошта',
'Погано','Bockbier','ФФУ'
)